import os

WINDOWS_CD = ''
LINUX_CD = './'

PAGE_PNG_PATH = '.'+os.path.sep+'PageImages'+os.path.sep
VOTER_PNG_PATH = '.'+os.path.sep+'VoterImages'+os.path.sep
TESS_LANGAUGE_VOTER_DETAIL = 'eng+Devanagari'
TESS_LANGAUGE_COMMON_DETAIL = 'Devanagari'
PREFIX_VOTER_TEXTFILE = 'voter'
PREFIX_VOTER_TEXTFILE_DELETED = 'deleted'
PREFIX_VOTER_TEXTFILE_NEW = 'new'
COMMON_VOTER_DETAIL_TEXTFILE = 'CommonDetails.txt'
# LAYOUT_TEXTFILE = 'layout.txt'

WORDLIST_NAGARPALIKA_NAME = [' पालिक ']
WORDLIST_NAGARPALIKA_BHAG_NO = [' भाग ']
WORDLIST_NAGARPALIKA_POLLING_BOOTH = [' केंद्र ']
WORDLIST_NAGARPALIKA_SUBSECTION = ['(1) (2)']
# WORDLIST_MALE = ['पचरष', 'पपरष', 'पडरष', 'पजरष', 'पष', 'पझरष', 'पकरष', 'पखरष', 'पफरष']
# REPLACE_WORD_AGE = WORDLIST_FEMALE + WORDLIST_MALE+['आजच: ', 'आखप:', 'आजप:', 'आजड:', 'आजज:', 'आजस:', 'आयप:', 'आजझ:', 'आखक:', 'आजक:', '\n', 'आखख:', 'आजफ:']
# WORDLIST_DATE = ['गहन पचनरलकण', 'गरन पपनररकण', 'गरन पपनरड़कण', 'गरन पपनरटकण', 'गरन पपनरसकण', 'गरन पपनरबकण', 'गरन पपनरभकण', 'गरन पपनरणकण', 'गहन पपनरपकण', 'गरन पपनरशकण', 'गहन पपनररकण', 'गरन पपनरलकण', 'गरन पपनरनकण', 'गरन पचनरडकण', 'गरन पकनरदकण', 'गरन पपनरपकण', 'गरन पखनरनकण']
# WORDLIST_NAGARPARISHAD_WARD_NO = ['वपरर सनखखप', 'वपरर सगखखप', 'वपरर सनखयप', 'वपणर सगखखप', 'वपडर समखखप', 'वपरर सरखखप', 'वपडर सडखखप', 'मपग सनखखप', 'वपरर सबखखप', 'वपरर सवखखप', 'वपरर ससखखप', 'वपरर ससखयप']
# WORDLIST_FIRST_PAGE_BREAK = ['पपजलकरण', 'पनजरकरण', 'पनजड़करण', 'पगजटकरण', 'पनजसकरण', 'पनजबकरण', 'पनरसकरण', 'पनजभकरण', 'पनररकरण', 'पनसरकरण', 'पगजणकरण', 'पनजपकरण', 'पनरभकरण', 'पनबभकरण', 'पगजरकरण', 'पमजरकरण', 'परजरकरण', 'पडजशकरण', 'पननरकरण', 'पनबरकरण', 'परबरकरण', 'पनसभकरण', 'पगरटकरण', 'पगसटकरण', 'पनजलकरण', 'पमजनकरण', 'पनजटकरण', 'पनजडकरण', 'पडजरकरण', 'पबजदकरण', 'पनजशकरण', 'पनरलकरण', 'पवजरकरण', 'पबजपकरण', 'पनजनकरण', 'पसजरकरण', 'पसजसकरण']
# WORDLIST_PAGE_NO = ['पतष सपखजर', 'पतष सनखखप', 'पपष ससखजर', 'पपष सगखजर', 'पतष सगखखप', 'पसष सनखखप', 'पपष सपखजर', 'पतष सनखयप', 'पकष सनखखप', 'पपष सनखखप', 'पकष सनखयप', 'पवष सनखखप', 'पकष ससखजर', 'पनष सगखजर', 'पतष समखखप', 'पपष समखजर', 'पतष सरखखप', 'पतष सडखखप', 'पपष सडखजर', 'पतष सनखजर', 'पगष सनखखप', 'पकष सडखखप', 'पडष सनखखप', 'पसष सगखखप', 'पकष सगखखप', 'पसष सनखयप', 'पबष सनखखप', 'पतष सबखखप', 'पतष सवखखप', 'पतष ससखखप', 'पतष ससखयप']

# WORDLIST_SUBSECTION = ['क्षेत्र', 'विधानसभा', 'आयुः', 'लिंगः', 'पुरूष', 'स्री', 'घटक', 'भाग संख्या', 'वार्ड संख्या :']

PDF_TYPES = ('Nagar Parishad', 'Jila Parishad')
